import numpy as np

# 一般來說：

# 把m×n矩陣與n×p矩陣相乘，n必須相同，
# 相乘結果是m×p矩陣。
# [1, 2]   [5, 6]
# |    | x |    |
# [3 ,4]   [7, 8]
# = 
# [1*5 + 2*7,  1*6 + 2*8]
# |                     |
# [3*5 + 4*7,  3*6 + 4*8]
# = 
# [19, 22]
# |      |
# [43, 50]
a = np.array([[1, 2], [3, 4]])
b = np.array([[5, 6], [7, 8]])

# 使用 numpy.dot 函數
c = np.dot(a, b)
print(c)

# 使用 @ 運算符
c = a @ b
print(c)

# 轉置矩陣
A = np.array([[1, 2, 3], [4, 5, 6]])
print(A)
# 輸出：
# [[1 2 3]
#  [4 5 6]]

A_T = A.T
print(A_T)
# 輸出：
# [[1 4]
#  [2 5]
#  [3 6]]


# 矩陣的逆
A = np.array([[4, 7], [2, 6]])
print(A)
# 輸出：
# [[4 7]
#  [2 6]]

A_inv = np.linalg.inv(A)
print(A_inv)
# 輸出：
# [[ 0.6 -0.7]
# [-0.2  0.4]]

I = np.dot(A, A_inv)
print(I)
# 輸出：
# [[1. 0.]
#  [0. 1.]]